---
kind: method
id: M:Autodesk.Revit.DB.Electrical.WireSizeSet.ReverseIterator
source: html/bda4888e-499a-c944-7a40-764eb81e33c5.htm
---
# Autodesk.Revit.DB.Electrical.WireSizeSet.ReverseIterator Method

Retrieve a backward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual WireSizeSetIterator ReverseIterator()
```

## Returns
Returns a backward moving iterator to the set.